Repository: chrissharp80/emuqu
Catalog: Emuqu/Help.xcstrings
Source language: en
Languages: ar, da, de, es, fi, fr, is, it, ja, ko, nb, nl, pt_br, ru, sv, zh_hans

source: On iOS 18 and later, dynamically generated text — your analysis summary, score breakdowns, readiness messages, and coaching tips — is translated on-device using Apple's Translation framework. No internet connection required. The first time you use a language, iOS may prompt you to download the language pack.
ar: على iOS 18 وما بعده، يُترجم النص المُنشأ ديناميكيًا — ملخص التحليل وتفصيل النتائج ورسائل الجاهزية ونصائح التوجيه — على الجهاز باستخدام إطار Translation من Apple. لا حاجة إلى اتصال بالإنترنت. في المرة الأولى التي تستخدم فيها لغة، قد يطلب منك iOS تنزيل حزمة اللغة.
da: På iOS 18 og nyere oversættes dynamisk genereret tekst — din analyseoversigt, scoreopdelinger, parathedsbeskeder og coachingtip — på enheden med Apples Translation-framework. Ingen internetforbindelse kræves. Første gang du bruger et sprog, beder iOS dig måske om at hente sprogpakken.
de: Ab iOS 18 wird dynamisch erzeugter Text — deine Analysezusammenfassung, Wertaufschlüsselungen, Bereitschaftsmeldungen und Coaching-Tipps — mit Apples Übersetzungs-Framework auf dem Gerät übersetzt. Keine Internetverbindung nötig. Beim ersten Verwenden einer Sprache fordert iOS dich eventuell auf, das Sprachpaket herunterzuladen.
es: En iOS 18 y posteriores, el texto generado dinámicamente —tu resumen de análisis, los desgloses de puntuación, los mensajes de preparación y los consejos— se traduce en el dispositivo con el framework Translation de Apple. No hace falta conexión a internet. La primera vez que uses un idioma, iOS puede pedirte que descargues el paquete de idioma.
fi: iOS 18:ssa ja uudemmissa dynaamisesti luotu teksti — analyysisi yhteenveto, pisteiden erittelyt, valmiusviestit ja valmennusvinkit — käännetään laitteessa Applen Translation-kehyksellä. Internet-yhteyttä ei tarvita. Kun käytät kieltä ensimmäistä kertaa, iOS saattaa pyytää lataamaan kielipaketin.
fr: Sous iOS 18 et versions ultérieures, le texte généré dynamiquement — votre résumé d’analyse, la répartition des scores, les messages d’état de préparation et les conseils de coaching — est traduit sur l’appareil grâce au framework Translation d’Apple. Aucune connexion Internet requise. La première fois que vous utilisez une langue, iOS peut vous proposer de télécharger le pack de langue.
is: Í iOS 18 og nýrri er kvikt myndaður texti — samantekt greiningar, sundurliðun stiga, viðbúnaðarskilaboð og þjálfunarráð — þýddur á tækinu með Translation-kerfi Apple. Engin nettenging nauðsynleg. Í fyrsta sinn sem þú notar tungumál gæti iOS beðið þig um að sækja tungumálapakkann.
it: Su iOS 18 e successivi il testo generato dinamicamente — riepilogo dell'analisi, dettagli del punteggio, messaggi di prontezza e consigli di coaching — viene tradotto sul dispositivo con il framework Translation di Apple. Non serve una connessione a Internet. La prima volta che usi una lingua, iOS potrebbe chiederti di scaricare il pacchetto della lingua.
ja: iOS 18 以降では、動的に生成されるテキスト — 分析サマリー、スコアの内訳、準備状態のメッセージ、コーチングのヒント — が、Apple の Translation フレームワークを使ってデバイス上で翻訳されます。インターネット接続は不要です。初めてその言語を使うときに、iOS から言語パックのダウンロードを求められることがあります。
ko: iOS 18 이상에서는 동적으로 생성되는 텍스트 — 분석 요약, 점수 세부 내역, 준비 상태 메시지, 코칭 팁 — 가 Apple의 Translation 프레임워크를 사용해 기기에서 번역됩니다. 인터넷 연결이 필요 없습니다. 어떤 언어를 처음 사용할 때 iOS가 언어 팩을 다운로드하라고 요청할 수 있습니다.
nb: På iOS 18 og nyere blir dynamisk generert tekst — analyseoppsummeringen, scorefordelingen, beredskapsmeldinger og coachingtips — oversatt på enheten med Apples Translation-rammeverk. Ingen internettilkobling er nødvendig. Første gang du bruker et språk, kan iOS be deg laste ned språkpakken.
nl: Op iOS 18 en later wordt dynamisch gegenereerde tekst — je analyseoverzicht, de opbouw van je score, gereedheidsberichten en coachingtips — op het apparaat vertaald met het Translation-framework van Apple. Geen internetverbinding nodig. De eerste keer dat je een taal gebruikt, kan iOS vragen het taalpakket te downloaden.
pt_br: No iOS 18 e posterior, os textos gerados dinamicamente — seu resumo de análise, a composição das pontuações, as mensagens de prontidão e as dicas de orientação — são traduzidos no dispositivo usando o framework Translation da Apple. Não é preciso conexão com a internet. Na primeira vez que você usar um idioma, o iOS pode pedir para baixar o pacote de idioma.
ru: В iOS 18 и новее динамически создаваемый текст — сводка анализа, разбор оценок, сообщения о готовности и тренерские советы — переводится на устройстве с помощью фреймворка Apple Translation. Интернет не нужен. При первом использовании языка iOS может предложить загрузить языковой пакет.
sv: På iOS 18 och senare översätts dynamiskt genererad text — din analyssammanfattning, poänguppdelningar, beredskapsmeddelanden och coachningstips — på enheten med Apples Translation-ramverk. Ingen internetanslutning krävs. Första gången du använder ett språk kan iOS be dig ladda ned språkpaketet.
zh_hans: 在 iOS 18 及更高版本上，动态生成的文字 — 你的分析摘要、评分构成、准备状态信息和指导提示 — 会使用 Apple 的翻译框架在设备上翻译。无需联网。首次使用某种语言时，iOS 可能会提示你下载语言包。

source: On the Record tab, make sure Extended is selected
ar: في علامة تبويب التسجيل، تأكد من اختيار «موسّع»
da: Sørg for, at Udvidet er valgt på fanen Optag
de: Achte im Aufnahme-Tab darauf, dass „Erweitert“ ausgewählt ist
es: En la pestaña Grabar, asegúrate de que esté seleccionado Ampliado
fi: Varmista Tallenna-välilehdellä, että Laajennettu on valittuna
fr: Dans l’onglet Enregistrer, vérifiez que Étendu est sélectionné
is: Á Upptöku-flipanum skaltu ganga úr skugga um að Útvíkkað sé valið
it: Nella scheda Registra, assicurati che sia selezionato Esteso
ja: 記録タブで「拡張」が選択されていることを確認してください
ko: 기록 탭에서 확장이 선택되어 있는지 확인하세요
nb: Sørg for at Utvidet er valgt på Opptak-fanen
nl: Zorg dat op het tabblad Opnemen Uitgebreid is geselecteerd
pt_br: Na aba Gravar, verifique se Estendido está selecionado
ru: На вкладке «Запись» убедитесь, что выбран режим «Расширенный»
sv: Se till att Utökad är vald på fliken Spela in
zh_hans: 在“记录”标签页上，确保已选中“扩展”

source: On-demand tool calls instead of a big data dump per message
ar: استدعاءات أدوات عند الطلب بدلًا من تفريغ بيانات ضخم مع كل رسالة
da: Værktøjskald efter behov i stedet for et stort dataudtræk pr. besked
de: Tool-Aufrufe nach Bedarf statt eines großen Datenpakets pro Nachricht
es: Llamadas a herramientas bajo demanda en lugar de un gran volcado de datos por mensaje
fi: Työkalukutsut tarpeen mukaan suuren viestikohtaisen tietomassan sijaan
fr: Appels d’outils à la demande au lieu d’un gros export de données à chaque message
is: Verkfæraköll eftir þörfum í stað stórs gagnahaugs í hverju skeyti
it: Chiamate agli strumenti su richiesta invece di un grande invio di dati a ogni messaggio
ja: メッセージごとに大量のデータを送る代わりに、必要に応じてツールを呼び出します
ko: 메시지마다 큰 데이터 덤프 대신 필요할 때 도구 호출
nb: Verktøykall ved behov i stedet for en stor datadump i hver melding
nl: Tools op verzoek in plaats van een grote datadump per bericht
pt_br: Chamadas de ferramentas sob demanda em vez de um grande despejo de dados por mensagem
ru: Вызовы инструментов по запросу вместо большой выгрузки данных в каждом сообщении
sv: Verktygsanrop vid behov i stället för en stor datadump per meddelande
zh_hans: 按需调用工具，而不是每条消息都塞入大量数据

source: Once connected, choose 3 min (Standard) duration
ar: بعد الاتصال، اختر مدة 3 دقائق (قياسي)
da: Når der er forbindelse, så vælg varigheden 3 min (Standard)
de: Wähle nach dem Verbinden die Dauer 3 Min. (Standard)
es: Una vez conectado, elige la duración de 3 min (Estándar)
fi: Kun yhteys on muodostettu, valitse kestoksi 3 min (Vakio)
fr: Une fois connecté, choisissez la durée de 3 min (Standard)
is: Þegar tengt er skaltu velja 3 mín. lengd (Staðlað)
it: Una volta connesso, scegli la durata di 3 min (Standard)
ja: 接続したら、記録時間として 3 分（標準）を選択します
ko: 연결되면 3분(표준) 시간을 선택하세요
nb: Når enheten er tilkoblet, velger du varighet 3 min (Standard)
nl: Kies na het verbinden een duur van 3 min (Standaard)
pt_br: Depois de conectar, escolha a duração de 3 min (Padrão)
ru: После подключения выберите продолжительность 3 мин (Стандарт)
sv: När den är ansluten väljer du längden 3 min (Standard)
zh_hans: 连接后，选择 3 分钟（标准）时长

source: Once your Recovery Score activates, it becomes the primary indicator on your dashboard. Readiness remains in your detailed report as a quick sanity check.
ar: بمجرد تفعيل درجة التعافي، تصبح المؤشر الأساسي في لوحة المعلومات. تبقى الجاهزية في تقريرك المفصّل كفحص سريع للمعقولية.
da: Når din restitutionsscore aktiveres, bliver den den primære indikator på din oversigt. Parathed forbliver i din detaljerede rapport som et hurtigt fornuftstjek.
de: Sobald dein Erholungs-Score aktiv ist, wird er zum wichtigsten Indikator in deiner Übersicht. Die Bereitschaft bleibt in deinem Detailbericht als schnelle Plausibilitätsprüfung erhalten.
es: Cuando se activa tu puntuación de recuperación, pasa a ser el indicador principal de tu panel. La preparación sigue en tu informe detallado como comprobación rápida.
fi: Kun palautumispistemääräsi aktivoituu, siitä tulee kojelautasi ensisijainen ilmaisin. Valmius säilyy yksityiskohtaisessa raportissasi nopeana tarkistuksena.
fr: Une fois votre score de récupération activé, il devient l’indicateur principal de votre tableau de bord. L’état de préparation reste dans votre rapport détaillé comme contrôle rapide.
is: Þegar batastigið þitt virkjast verður það aðalvísirinn á yfirsýninni. Viðbúnaður er áfram í ítarlegu skýrslunni sem fljótleg viðmiðun.
it: Quando il punteggio di recupero si attiva, diventa l'indicatore principale del pannello. La prontezza resta nel rapporto dettagliato come rapido controllo di coerenza.
ja: 回復スコアが有効になると、それがダッシュボードの主要な指標になります。準備状態は、手早い確認用として詳細レポートに残ります。
ko: 회복 점수가 활성화되면 대시보드의 주요 지표가 됩니다. 준비 상태는 빠른 확인용으로 상세 리포트에 남아 있습니다.
nb: Når restitusjonsscoren er aktivert, blir den hovedindikatoren på oversikten din. Beredskap blir værende i den detaljerte rapporten som en rask kontroll.
nl: Zodra je herstelscore actief wordt, is dat de belangrijkste indicator op je dashboard. Gereedheid blijft in je gedetailleerde rapport staan als snelle controle.
pt_br: Quando sua Pontuação de Recuperação é ativada, ela passa a ser o indicador principal no seu painel. A prontidão continua no seu relatório detalhado como uma verificação rápida.
ru: Когда оценка восстановления активируется, она становится главным показателем на панели. Готовность остаётся в подробном отчёте как быстрая проверка.
sv: När din återhämtningspoäng aktiveras blir den huvudindikatorn på din översikt. Beredskap finns kvar i din detaljerade rapport som en snabb rimlighetskontroll.
zh_hans: 恢复评分启用后，它会成为仪表盘上的主要指标。准备状态仍保留在你的详细报告中，作为快速核对。

source: One more caveat, for the live α1 readout during workouts. Even a chest strap is not the same as an ECG for this metric: against ECG, chest-strap α1 shows limits of agreement of about ±10% at low intensity, widening to roughly +58% / −41% at high intensity. The band the app shows you (Easy / Threshold / Hard) is a reasonable live guide, but a single α1 value at hard effort carries a lot of uncertainty, and that is before anything the artifact filter has had to correct.
ar: تحفّظ آخر، يخص عرض α1 المباشر أثناء التمارين. حتى حزام الصدر ليس مثل ECG في هذا المقياس: مقارنةً بـ ECG، تُظهر قيم α1 من حزام الصدر حدود توافق تقارب ±10% عند الشدة المنخفضة، وتتسع إلى نحو +58% / −41% عند الشدة العالية. النطاق الذي يعرضه التطبيق (سهل / عتبة / شاق) دليل مباشر معقول، لكن قيمة α1 منفردة عند جهد شاق تحمل قدرًا كبيرًا من عدم اليقين، وذلك قبل أي تصحيح اضطر إليه مرشح أخطاء القياس.
da: Endnu et forbehold, for live-visningen af α1 under træning. Selv et brystbælte er ikke det samme som et EKG for denne måling: sammenlignet med EKG viser α1 fra brystbælte overensstemmelsesgrænser på ca. ±10 % ved lav intensitet, der udvides til ca. +58 % / −41 % ved høj intensitet. Det bånd, appen viser dig (Let / Tærskel / Hård), er en rimelig live-guide, men en enkelt α1-værdi ved hård indsats er behæftet med stor usikkerhed, og det er før alt det, artefaktfilteret har måttet korrigere.
de: Noch ein Vorbehalt zur Live-Anzeige von α1 während des Trainings: Selbst ein Brustgurt ist für diese Metrik nicht dasselbe wie ein EKG. Im Vergleich zum EKG zeigt α1 vom Brustgurt Übereinstimmungsgrenzen von etwa ±10 % bei niedriger Intensität, die sich bei hoher Intensität auf etwa +58 % / −41 % erweitern. Das angezeigte Band (Locker / Schwelle / Hart) ist eine brauchbare Live-Orientierung, aber ein einzelner α1-Wert bei harter Belastung ist mit großer Unsicherheit behaftet — und das noch vor allem, was der Artefaktfilter korrigieren musste.
es: Una advertencia más, sobre la lectura de α1 en directo durante los entrenamientos. Ni siquiera una banda de pecho equivale a un ECG para esta métrica: frente al ECG, el α1 de banda de pecho muestra límites de concordancia de aproximadamente ±10 % a baja intensidad, que se amplían a cerca de +58 % / −41 % a alta intensidad. La franja que te muestra la app (Suave / Umbral / Duro) es una guía razonable en directo, pero un único valor de α1 a esfuerzo alto conlleva mucha incertidumbre, y eso antes de lo que haya tenido que corregir el filtro de artefactos.
fi: Vielä yksi varaus harjoitusten aikaisesta reaaliaikaisesta α1-näytöstä. Edes rintavyö ei vastaa tämän mittarin osalta EKG:tä: EKG:hen verrattuna rintavyön α1:n yhtäpitävyysrajat ovat noin ±10 % matalalla intensiteetillä ja levenevät noin +58 % / −41 %:iin korkealla intensiteetillä. Sovelluksen näyttämä alue (Kevyt / Kynnys / Kova) on järkevä reaaliaikainen suuntaviiva, mutta yksittäiseen α1-arvoon kovalla teholla liittyy paljon epävarmuutta, ja se on vielä ennen kaikkea, mitä artefaktisuodatin on joutunut korjaamaan.
fr: Une dernière réserve, pour l’affichage α1 en direct pendant les séances. Même une ceinture pectorale n’équivaut pas à un ECG pour cette métrique : par rapport à l’ECG, l’α1 mesuré par ceinture présente des limites de concordance d’environ ±10 % à faible intensité, s’élargissant à environ +58 % / −41 % à haute intensité. La bande que l’app vous montre (Facile / Seuil / Difficile) est un guide raisonnable en direct, mais une valeur α1 isolée à effort intense comporte beaucoup d’incertitude, et ce avant même toute correction effectuée par le filtre d’artéfacts.
is: Einn fyrirvari í viðbót, um beina α1-birtingu á æfingum. Jafnvel brjóstól er ekki það sama og hjartalínurit fyrir þessa mælingu: miðað við hjartalínurit sýnir α1 frá brjóstól samræmismörk upp á um ±10% við litla ákefð, sem víkka í um það bil +58% / −41% við mikla ákefð. Bilið sem appið sýnir þér (Létt / Þröskuldur / Erfitt) er hæfilegur leiðarvísir í rauntíma, en stakt α1-gildi við mikla áreynslu ber mikla óvissu, og það áður en litið er til þess sem truflanasían hefur þurft að leiðrétta.
it: Un'ultima avvertenza, sulla lettura di α1 in tempo reale durante gli allenamenti. Nemmeno una fascia toracica equivale a un ECG per questa metrica: rispetto all'ECG, l'α1 da fascia toracica mostra limiti di accordo di circa ±10% a bassa intensità, che si allargano a circa +58% / −41% ad alta intensità. La fascia che l'app ti mostra (Facile / Soglia / Duro) è una guida ragionevole in tempo reale, ma un singolo valore di α1 a sforzo intenso porta con sé molta incertezza, e questo prima ancora di ciò che il filtro degli artefatti ha dovuto correggere.
ja: ワークアウト中のライブ α1 表示についてもう一つ注意点があります。この指標については、チェストストラップでも ECG と同じではありません：ECG と比べると、チェストストラップの α1 の一致限界は低強度で約 ±10%、高強度では約 +58% / −41% まで広がります。アプリが示す帯（Easy / Threshold / Hard）はライブの目安としては妥当ですが、高強度での単一の α1 値には大きな不確かさがあり、しかもそれはアーチファクトフィルタによる補正を考慮する前の話です。
ko: 운동 중 실시간 α1 표시에 대해 한 가지 더 주의할 점. 이 지표에서는 가슴 스트랩조차 ECG와 같지 않습니다: ECG와 비교하면 가슴 스트랩 α1의 일치 한계는 저강도에서 약 ±10%이고, 고강도에서는 대략 +58% / −41%로 넓어집니다. 앱이 보여 주는 구간(쉬움 / 역치 / 고강도)은 합리적인 실시간 안내이지만, 고강도에서의 단일 α1 값은 불확실성이 크며, 이는 아티팩트 필터가 보정한 부분을 고려하기 전의 이야기입니다.
nb: Ett forbehold til, for den direkte α1-visningen under økter. Selv et pulsbelte er ikke det samme som EKG for dette måltallet: sammenlignet med EKG har α1 fra pulsbelte samsvarsgrenser på omtrent ±10 % ved lav intensitet, som utvides til omtrent +58 % / −41 % ved høy intensitet. Båndet appen viser deg (Lett / Terskel / Hard), er en fornuftig veiledning underveis, men én enkelt α1-verdi ved hard innsats er svært usikker, og det før artefaktfilteret har måttet korrigere noe.
nl: Nog één kanttekening, bij de live α1-weergave tijdens trainingen. Zelfs een borstband is voor deze waarde niet hetzelfde als een ecg: vergeleken met ecg heeft α1 van een borstband overeenstemmingsgrenzen van ongeveer ±10% bij lage intensiteit, oplopend tot zo’n +58% / −41% bij hoge intensiteit. De band die de app toont (Licht / Drempel / Zwaar) is een redelijke live richtlijn, maar één α1-waarde bij zware inspanning is erg onzeker, en dat is nog vóór wat het artefactfilter heeft moeten corrigeren.
pt_br: Mais uma ressalva, sobre a leitura de α1 ao vivo durante os treinos. Mesmo uma cinta peitoral não equivale a um ECG para esta métrica: em comparação com o ECG, o α1 da cinta peitoral mostra limites de concordância de cerca de ±10% em baixa intensidade, ampliando-se para aproximadamente +58% / −41% em alta intensidade. A faixa que o app mostra (Leve / Limiar / Forte) é um guia razoável ao vivo, mas um único valor de α1 em esforço intenso traz muita incerteza, e isso antes de qualquer correção que o filtro de artefatos tenha precisado fazer.
ru: Ещё одна оговорка — для живого показателя α1 во время тренировок. Даже нагрудный датчик для этого показателя не равен ЭКГ: по сравнению с ЭКГ пределы согласия α1 с нагрудного датчика составляют около ±10% при низкой интенсивности и расширяются примерно до +58% / −41% при высокой. Полоса, которую показывает приложение (Лёгкая / Порог / Тяжёлая), — разумный ориентир в реальном времени, но отдельное значение α1 при тяжёлом усилии несёт большую неопределённость, и это ещё без учёта того, что пришлось исправить фильтру артефактов.
sv: Ytterligare en reservation, för den direktvisade α1-avläsningen under träningspass. Inte ens ett bröstband är detsamma som ett EKG för det här måttet: jämfört med EKG visar bröstbandets α1 överensstämmelsegränser på ungefär ±10 % vid låg intensitet, som vidgas till ungefär +58 % / −41 % vid hög intensitet. Zonen appen visar (Lätt / Tröskel / Hård) är en rimlig vägledning i realtid, men ett enskilt α1-värde vid hård ansträngning är mycket osäkert, och då har man inte ens räknat med det artefaktfiltret har behövt korrigera.
zh_hans: 关于训练期间的实时 α1 读数，还有一点需要注意。就这一指标而言，即使是胸带也不等同于心电图：与心电图相比，胸带测得的 α1 在低强度时一致性界限约为 ±10%，在高强度时扩大到约 +58% / −41%。应用显示的区间（轻松 / 阈值 / 高强度）是合理的实时参考，但高强度时单个 α1 数值的不确定性很大，这还没算上伪迹过滤器所做的校正。

source: One question triggers up to four tool calls. The 5th call returns a synthetic "tool budget exceeded" result so the model composes a brief failure response instead of looping forever on a bad argument.
ar: يُطلق سؤال واحد حتى أربعة استدعاءات أدوات. يُرجع الاستدعاء الخامس نتيجة اصطناعية «تجاوز ميزانية الأدوات» فيصوغ النموذج ردًا موجزًا بالإخفاق بدلًا من الدوران إلى الأبد على وسيط خاطئ.
da: Ét spørgsmål udløser op til fire værktøjskald. Det 5. kald returnerer et syntetisk resultat om »værktøjsbudget overskredet«, så modellen formulerer et kort fejlsvar i stedet for at køre i ring på et dårligt argument.
de: Eine Frage löst bis zu vier Tool-Aufrufe aus. Der 5. Aufruf liefert ein künstliches Ergebnis „Tool-Budget überschritten“, damit das Modell eine kurze Fehlermeldung formuliert, statt sich wegen eines fehlerhaften Arguments endlos im Kreis zu drehen.
es: Una pregunta desencadena hasta cuatro llamadas a herramientas. La quinta devuelve un resultado sintético de «presupuesto de herramientas superado» para que el modelo redacte una breve respuesta de error en lugar de quedarse en bucle con un argumento erróneo.
fi: Yksi kysymys käynnistää enintään neljä työkalukutsua. Viides kutsu palauttaa keinotekoisen "työkalubudjetti ylitetty" -tuloksen, jotta malli muotoilee lyhyen virhevastauksen eikä jää loputtomaan silmukkaan virheellisen argumentin kanssa.
fr: Une question déclenche jusqu’à quatre appels d’outils. Le 5e appel renvoie un résultat synthétique « budget d’outils dépassé » pour que le modèle rédige une brève réponse d’échec au lieu de boucler indéfiniment sur un mauvais argument.
is: Ein spurning kallar á allt að fjögur verkfæraköll. 5. kallið skilar tilbúinni niðurstöðu um að „verkfærakvóti sé uppurinn“ svo líkanið semur stutt villusvar í stað þess að festast í lykkju á slæmu frumbreytugildi.
it: Una domanda attiva fino a quattro chiamate agli strumenti. La quinta chiamata restituisce un risultato sintetico "budget degli strumenti superato", così il modello compone una breve risposta di errore invece di girare all'infinito su un argomento sbagliato.
ja: 1 つの質問で最大 4 回までツールを呼び出します。5 回目の呼び出しには「ツール予算超過」という合成結果が返され、モデルが不正な引数で無限にループする代わりに、簡単な失敗の応答を組み立てるようにします。
ko: 질문 하나에 최대 네 번의 도구 호출이 발생합니다. 다섯 번째 호출은 합성된 "도구 예산 초과" 결과를 반환하므로, 모델이 잘못된 인수로 끝없이 반복하는 대신 짧은 실패 응답을 작성합니다.
nb: Ett spørsmål utløser opptil fire verktøykall. Det 5. kallet returnerer et syntetisk «verktøybudsjett overskredet»-resultat, slik at modellen skriver et kort feilsvar i stedet for å gå i løkke for alltid på et dårlig argument.
nl: Eén vraag leidt tot maximaal vier toolaanroepen. De 5e aanroep geeft een kunstmatig resultaat ‘toolbudget overschreden’ terug, zodat het model een kort foutantwoord opstelt in plaats van eindeloos door te gaan op een fout argument.
pt_br: Uma pergunta aciona até quatro chamadas de ferramentas. A 5ª chamada retorna um resultado sintético de "orçamento de ferramentas excedido", para que o modelo componha uma breve resposta de falha em vez de ficar em loop eterno com um argumento ruim.
ru: Один вопрос запускает до четырёх вызовов инструментов. Пятый вызов возвращает искусственный результат «превышен бюджет инструментов», чтобы модель составила краткий ответ о неудаче, а не зацикливалась бесконечно на неверном аргументе.
sv: En fråga utlöser upp till fyra verktygsanrop. Det 5:e anropet returnerar ett syntetiskt resultat "verktygsbudget överskriden" så att modellen skriver ett kort felsvar i stället för att fastna i en loop på ett felaktigt argument.
zh_hans: 一个问题最多触发四次工具调用。第 5 次调用会返回一个合成的“超出工具预算”结果，让模型给出简短的失败回复，而不是因为一个错误参数无限循环。
